CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_rtc.c
        RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_sample_frequency);
        RTC_TAMP |= (uint32_t)(rtc_tamper->tamper_filter);
        
        /* configure the tamper trigger */
        RTC_TAMP &= ((uint32_t)~((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS));    
        if(RTC_TAMPER_TRIGGER_LEVEL_LOW != rtc_tamper->tamper_trigger){
            RTC_TAMP |= (uint32_t)((rtc_tamper->tamper_source)<< RTC_TAMPER_TRIGGER_POS);
        }
    }else{
        /* configure the tamper trigger */
        RTC_TAMP &= ((uint32_t)~((rtc_tamper->tamper_source) << RTC_TAMPER_TRIGGER_POS));    
        if(RTC_TAMPER_TRIGGER_EDGE_RISING != rtc_tamper->tamper_trigger){
            RTC_TAMP |= (uint32_t)((rtc_tamper->tamper_source)<< RTC_TAMPER_TRIGGER_POS);  
        }
    }
    RTC_TAMP &= (uint32_t)~RTC_TAMP_TPTS;      
    if(DISABLE != rtc_tamper->tamper_with_timestamp){           
        /* the tamper event also cause a time-stamp event */
        RTC_TAMP |= (uint32_t)RTC_TAMP_TPTS;
    }
    /* enable tamper */
    RTC_TAMP |=  (uint32_t)(rtc_tamper->tamper_source); 
}

/*!
    \brief      disable RTC tamper
    \param[in]  source: specify which tamper source to be disabled
      \arg        RTC_TAMPER0
      \arg        RTC_TAMPER1
    \param[out] none
    \retval     none
*/
void rtc_tamper_disable(uint32_t source)
{
    /* disable tamper */
    RTC_TAMP &= (uint32_t)~source; 

}

/*!
    \brief      reset the RTC_BKP registers by sofware
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rtc_software_bkp_reset(void)
{
    RTC_TAMP |= RTC_TAMP_BKERASE; 
}

/*!
    \brief      tamperx event does not erase the RTC_BKP registers
    \param[in]  ne_source: specify which tamper source will not trigger the RTC_BKP registers reset
      \arg        RTC_TAMPXNOER_NONE: both tamper0 and tamper1 event will trigger RTC_BKP registers reset 
      \arg        RTC_TAMPXNOER_TP0: tamper0 event will not trigger RTC_BKP registers reset 
      \arg        RTC_TAMPXNOER_TP1: tamper1 event will not trigger RTC_BKP registers reset 
      \arg        RTC_TAMPXNOER_TP0_TP1: Neither tamper0 nor tamepr1 event will trigger RTC_BKP registers reset 
    \param[out] none
    \retval     none
*/
void rtc_tamper_without_bkp_seset(uint32_t ne_source)
{
    RTC_TAMP &= (uint32_t)~(RTC_TAMP_TP0NOER | RTC_TAMP_TP1NOER ); 
    RTC_TAMP |= ne_source;
}

/*!
    \brief      enable specified RTC interrupt
    \param[in]  interrupt: specify which interrupt source to be enabled
      \arg        RTC_INT_TIMESTAMP: timestamp interrupt
      \arg        RTC_INT_ALARM0: alarm0 interrupt
      \arg        RTC_INT_ALARM1: alarm1 interrupt
      \arg        RTC_INT_TAMP: tamper detection interrupt
      \arg        RTC_INT_WAKEUP: wakeup timer interrupt
    \param[out] none
    \retval     none
*/
void rtc_interrupt_enable(uint32_t interrupt)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    /* enable the interrupts in RTC_CTL register */
    RTC_CTL |= (uint32_t)(interrupt & (uint32_t)~RTC_TAMP_TPIE);
    /* enable the interrupts in RTC_TAMP register */
    RTC_TAMP |= (uint32_t)(interrupt & RTC_TAMP_TPIE);
    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY; 
}

/*!
    \brief      disble specified RTC interrupt
    \param[in]  interrupt: specify which interrupt source to be disabled
      \arg        RTC_INT_TIMESTAMP: timestamp interrupt
      \arg        RTC_INT_ALARM0: alarm0 interrupt
      \arg        RTC_INT_ALARM1: alarm1 interrupt
      \arg        RTC_INT_TAMP: tamper detection interrupt
      \arg        RTC_INT_WAKEUP: wakeup timer interrupt
    \param[out] none
    \retval     none
*/
void rtc_interrupt_disable(uint32_t interrupt)
{
    /* disable the interrupts in RTC_CTL register */
    RTC_CTL &= (uint32_t)~(interrupt & (uint32_t)~RTC_TAMP_TPIE);
    /* disable the interrupts in RTC_TAMP register */
    RTC_TAMP &= (uint32_t)~(interrupt & RTC_TAMP_TPIE);
}

/*!
    \brief      check specified flag
    \param[in]  flag: specify which flag to check
      \arg        RTC_FLAG_SCP: smooth calibration pending flag
      \arg        RTC_FLAG_TP1: RTC tamper 1 detected flag
      \arg        RTC_FLAG_TP0: RTC tamper 0 detected flag
      \arg        RTC_FLAG_TSOVR: time-stamp overflow flag
      \arg        RTC_FLAG_TS: time-stamp flag 
      \arg        RTC_FLAG_ALARM0: alarm0 occurs flag
      \arg        RTC_FLAG_ALARM1: alarm1 occurs flag
      \arg        RTC_FLAG_WT: wakeup timer occurs flag
      \arg        RTC_FLAG_INIT: initialization state flag
      \arg        RTC_FLAG_RSYN: register synchronization flag
      \arg        RTC_FLAG_YCM: year configuration mark status flag
      \arg        RTC_FLAG_SOP: shift function operation pending flag
      \arg        RTC_FLAG_ALARM0W: alarm0 configuration can be written flag
      \arg        RTC_FLAG_ALARM1W: alarm1 configuration can be written flag
      \arg        RTC_FLAG_WTW: wakeup timer can be written flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rtc_flag_get(uint32_t flag)
{
    FlagStatus flag_state = RESET;
    if((flag & RTC_FLAG_ICSRM) == RTC_FLAG_ICSRM){
        if ((uint32_t)RESET != (RTC_ICS & flag)){
            flag_state = SET;
        }
    }else{
          if ((uint32_t)RESET != (RTC_STAT & flag)){
            flag_state = SET;
        }
    }
    return flag_state;
}

/*!
    \brief      clear specified flag
    \param[in]  flag: specify which flag to clear
      \arg        RTC_FLAG_TP1: RTC tamper 1 detected flag
      \arg        RTC_FLAG_TP0: RTC tamper 0 detected flag
      \arg        RTC_FLAG_TSOVR: time-stamp overflow flag
      \arg        RTC_FLAG_TS: time-stamp flag
      \arg        RTC_FLAG_WT: wakeup timer occurs flag
      \arg        RTC_FLAG_ALARM0: alarm0 occurs flag
      \arg        RTC_FLAG_ALARM1: alarm1 occurs flag
      \arg        RTC_FLAG_RSYN: register synchronization flag
    \param[out] none
    \retval     none
*/
void rtc_flag_clear(uint32_t flag)
{
    if((flag & RTC_FLAG_ICSRM) == RTC_FLAG_ICSRM){
    /* RSYNF bit is also can be cleared by software writing 0 */
        RTC_ICS &= (uint32_t)(~flag);  
    }else{
    /* Writing 1 in a bit clears the corresponding bit in the RTC_STAT register. */
        RTC_STATC |= flag;
    }
}

/*!
    \brief      get specified non-secure interrupt flag
    \param[in]  int_flag: specify which flag to check
      \arg        RTC_NSMI_STAT_ALRM0NSMF: alarm0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_ALRM1NSMF: alarm1 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_WTNSMF: wakeup timer non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSNSMF: time-stamp non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSOVRNSMF: Time-stamp overflow non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP0NSMF: RTC_TAMP0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP1NSMF: RTC_TAMP1 non-secure interrupt masked flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rtc_nsec_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus flag_state = RESET;
    if ((uint32_t)RESET != (RTC_NSMI_STAT & int_flag)){
        flag_state = SET;
    }
    return flag_state;
}

/*!
    \brief      clear specified non-secure interrupt flag
    \param[in]  int_flag: specify which flag to clear
      \arg        RTC_NSMI_STAT_ALRM0NSMF: alarm0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_ALRM1NSMF: alarm1 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_WTNSMF: wakeup timer non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSNSMF: time-stamp non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TSOVRNSMF: Time-stamp overflow non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP0NSMF: RTC_TAMP0 non-secure interrupt masked flag
      \arg        RTC_NSMI_STAT_TP1NSMF: RTC_TAMP1 non-secure interrupt masked flag
    \param[out] none
    \retval     none
*/
void rtc_nsec_interrupt_flag_clear(uint32_t int_flag)
{
    /* Writing 1 in a bit clears the corresponding bit in the RTC_NSMI_STAT register. */
    RTC_STATC |= int_flag;
}

/*!
    \brief      get specified secure interrupt flag
    \param[in]  int_flag: specify which flag to check
      \arg        RTC_SMI_STAT_ALRM0SMF: alarm0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_ALRM1SMF: alarm1 secure interrupt masked flag
      \arg        RTC_SMI_STAT_WTSMF: wakeup timer secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSSMF: time-stamp secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSOVRSMF: Time-stamp overflow secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP0SMF: RTC_TAMP0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP1SMF: RTC_TAMP1 secure interrupt masked flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rtc_sec_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus flag_state = RESET;
    if ((uint32_t)RESET != (RTC_SMI_STAT & int_flag)){
        flag_state = SET;
    }
    return flag_state;
}

/*!
    \brief      clear specified secure interrupt flag
    \param[in]  int_flag: specify which flag to clear
      \arg        RTC_SMI_STAT_ALRM0SMF: alarm0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_ALRM1SMF: alarm1 secure interrupt masked flag
      \arg        RTC_SMI_STAT_WTSMF: wakeup timer secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSSMF: time-stamp secure interrupt masked flag
      \arg        RTC_SMI_STAT_TSOVRSMF: Time-stamp overflow secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP0SMF: RTC_TAMP0 secure interrupt masked flag
      \arg        RTC_SMI_STAT_TP1SMF: RTC_TAMP1 secure interrupt masked flag
    \param[out] none
    \retval     none
*/
void rtc_sec_interrupt_flag_clear(uint32_t int_flag)
{
    /* Writing 1 in a bit clears the corresponding bit in the RTC_SMI_STAT register. */
    RTC_STATC |= int_flag;
}

/*!
    \brief      select the RTC output pin pad
    \param[in]  pad: specify the rt output pad is PC15 or not
      \arg        RTC_OUT_PC15: the rtc output pad is PC15
      \arg        RTC_OUT_PA3_PA8: the rtc output pad is PA3 or PA8 according to the AFIO configuration
    \param[out] none
    \retval     none
*/
void rtc_output_pad_select(uint32_t pad)
{
    RTC_CTL &= (uint32_t)~(RTC_CTL_OUT2EN);
    RTC_CTL |= (uint32_t)(pad);
}

/*!
    \brief      configure rtc alarm output source
    \param[in]  source: specify signal to output
      \arg        RTC_ALARM0_HIGH: when the alarm0 flag is set, the output pin is high
      \arg        RTC_ALARM0_LOW: when the alarm0 flag is set, the output pin is low
      \arg        RTC_ALARM1_HIGH: when the alarm1 flag is set, the output pin is high
      \arg        RTC_ALARM1_LOW: when the alarm1 flag is set, the output pin is low
      \arg        RTC_WAKEUP_HIGH: when the wakeup flag is set, the output pin is high
      \arg        RTC_WAKEUP_LOW: when the wakeup flag is set, the output pin is low
    \param[in]  mode: specify the output pin mode when output alarm signal or auto wakeup signal
      \arg        RTC_ALARM_OUTPUT_OD: open drain mode
      \arg        RTC_ALARM_OUTPUT_PP: push pull mode
    \param[out] none
    \retval     none
*/
void rtc_alarm_output_config(uint32_t source, uint32_t mode)
{
    RTC_CTL &= ~(RTC_CTL_OS | RTC_CTL_OPOL);
    RTC_TAMP &= ~RTC_TAMP_AOT;

    RTC_CTL |= (uint32_t)(source);
    /* alarm output */
    RTC_TAMP |= (uint32_t)(mode);
}

/*!
    \brief      configure rtc calibration output source
    \param[in]  source: specify signal to output
      \arg        RTC_CALIBRATION_512HZ: when the LSE freqency is 32768Hz and the RTC_PSC 
                                         is the default value, output 512Hz signal
      \arg        RTC_CALIBRATION_1HZ: when the LSE freqency is 32768Hz and the RTC_PSC 
                                       is the default value, output 1Hz signal
    \param[out] none
    \retval     none
*/
void rtc_calibration_output_config(uint32_t source)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

