CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_rtc.c
    if ((uint32_t)RESET == flag_status){
        error_status = ERROR;
    }else{
        RTC_WUT = (uint32_t)wakeup_timer;
        error_status = SUCCESS;
    }

    return error_status;
}

/*!
    \brief      get wakeup timer value
    \param[in]  none
    \param[out] none
    \retval     wakeup timer value
*/
 uint16_t rtc_wakeup_timer_get(void)
{
    return (uint16_t)RTC_WUT;
}

/*!
    \brief      configure RTC smooth calibration
    \param[in]  window: select calibration window
      \arg        RTC_CALIBRATION_WINDOW_32S: 2exp20 RTCCLK cycles, 32s if RTCCLK = 32768 Hz
      \arg        RTC_CALIBRATION_WINDOW_16S: 2exp19 RTCCLK cycles, 16s if RTCCLK = 32768 Hz
      \arg        RTC_CALIBRATION_WINDOW_8S: 2exp18 RTCCLK cycles, 8s if RTCCLK = 32768 Hz
    \param[in]  plus: add RTC clock or not
      \arg        RTC_CALIBRATION_PLUS_SET: add one RTC clock every 2048 rtc clock
      \arg        RTC_CALIBRATION_PLUS_RESET: no effect
    \param[in]  minus: the RTC clock to minus during the calibration window(0x0 - 0x1FF)
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_smooth_calibration_config(uint32_t window, uint32_t plus, uint32_t minus)
{
    volatile uint32_t time_index = RTC_HRFC_TIMEOUT;
    ErrStatus error_status = ERROR;
    uint32_t flag_status = RESET;
    
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;    

    /* check if a smooth calibration operation is ongoing */        
    do{
        flag_status = RTC_ICS & RTC_ICS_SCPF;
    }while((--time_index > 0U) && ((uint32_t)RESET != flag_status));

    if((uint32_t)RESET == flag_status){
        RTC_HRFC = (uint32_t)(window | plus | HRFC_CMSK(minus));
        error_status = SUCCESS;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return error_status;
}

/*!
    \brief      enable RTC coarse calibration
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_coarse_calibration_enable(void)
{
    ErrStatus error_status = ERROR;
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status){ 
        RTC_CTL |= (uint32_t)RTC_CTL_CCEN;
        /* exit init mode */
        rtc_init_mode_exit();
    }
    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    return error_status;
}

/*!
    \brief      disable RTC coarse calibration
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_coarse_calibration_disable(void)
{
    ErrStatus error_status = ERROR;
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;    
    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status){ 
        RTC_CTL &= (uint32_t)~RTC_CTL_CCEN;
        /* exit init mode */
        rtc_init_mode_exit();
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;	
    return error_status;
}

/*!
    \brief      config coarse calibration direction and step
    \param[in]  direction: CALIB_INCREASE or CALIB_DECREASE
    \param[in]  step: 0x00-0x1F
                COSD=0:
                  0x00:+0 PPM
                  0x01:+4 PPM
                  0x02:+8 PPM
                  ....
                  0x1F:+126 PPM
                COSD=1:
                  0x00:-0 PPM
                  0x01:-2 PPM
                  0x02:-4 PPM
                  ....
                  0x1F:-63 PPM
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_coarse_calibration_config(uint8_t direction, uint8_t step)
{
    ErrStatus error_status = ERROR;
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status){ 
        if(CALIB_DECREASE == direction){
            RTC_COSC |= (uint32_t)RTC_COSC_COSD;
        }else{
            RTC_COSC &= (uint32_t)~RTC_COSC_COSD;
        }
        RTC_COSC &= ~RTC_COSC_COSS;
        RTC_COSC |= (uint32_t)((uint32_t)step & 0x1FU);
        /* exit init mode */
        rtc_init_mode_exit();
    }
    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    return error_status;
}

/*!
    \brief      enable RTC privilege protection mode
    \param[in]  sub_area: specify which sub area of the RTC module to be protected by the privilege mode
      \arg        RTC_PPM_CTL_ALRM0PRIP: Alarm 0 privilege protection
      \arg        RTC_PPM_CTL_ALRM1PRIP: Alarm 1 privilege protection 
      \arg        RTC_PPM_CTL_WUTPRIP: Wakeup timer privilege protection 
      \arg        RTC_PPM_CTL_TSPRIP: Timestamp privilege protection 
      \arg        RTC_PPM_CTL_TAMPPRIP: Tamper privilege protection (excluding backup registers)
      \arg        RTC_PPM_CTL_CALCPRIP: Shift register, daylight saving, calibration and reference clock privilege protection 
      \arg        RTC_PPM_CTL_INITPRIP: Initialization privilege protection
      \arg        RTC_PPM_CTL_RTCPRIP: RTC privilege protection 
      \arg        RTC_PPM_CTL_BKPRWPRIP: backup registers zone a privilege protection
      \arg        RTC_PPM_CTL_BKPWPRIP: backup registers zone b privilege protection 
    \param[out] none
    \retval     none
*/
void rtc_pri_pro_enable(uint32_t sub_area)
{ 
    RTC_PPM_CTL |= sub_area;
}

/*!
    \brief      disable RTC privilege protection mode
    \param[in]  sub_area: specify which sub area of the RTC module to be removed from the protection of the privilege mode
      \arg        RTC_PPM_CTL_ALRM0PRIP: Alarm 0 privilege protection
      \arg        RTC_PPM_CTL_ALRM1PRIP: Alarm 1 privilege protection 
      \arg        RTC_PPM_CTL_WUTPRIP: Wakeup timer privilege protection 
      \arg        RTC_PPM_CTL_TSPRIP: Timestamp privilege protection 
      \arg        RTC_PPM_CTL_TAMPPRIP: Tamper privilege protection (excluding backup registers)
      \arg        RTC_PPM_CTL_CALCPRIP: Shift register, daylight saving, calibration and reference clock privilege protection 
      \arg        RTC_PPM_CTL_INITPRIP: Initialization privilege protection
      \arg        RTC_PPM_CTL_RTCPRIP: RTC privilege protection 
      \arg        RTC_PPM_CTL_BKPRWPRIP: backup registers zone a privilege protection
      \arg        RTC_PPM_CTL_BKPWPRIP: backup registers zone b privilege protection 
    \param[out] none
    \retval     none
*/
void rtc_pri_pro_disable(uint32_t sub_area)
{ 
    RTC_PPM_CTL &= (uint32_t)~sub_area;
}

/*!
    \brief      enable RTC secure protection mode
    \param[in]  sub_area: specify which sub area of the RTC module to be protected by the secure mode
      \arg        RTC_SPM_CTL_ALRM0SECP: Alarm 0 secure protection
      \arg        RTC_SPM_CTL_ALRM1SECP: Alarm 1 secure protection 
      \arg        RTC_SPM_CTL_WUTSECP: Wakeup timer secure  protection 
      \arg        RTC_SPM_CTL_TSSECP: Timestamp secure protection 
      \arg        RTC_SPM_CTL_TAMPSECP: Tamper secure protection (excluding backup registers)
      \arg        RTC_SPM_CTL_CALCSECP: Shift register, daylight saving, calibration and reference clock secure protection 
      \arg        RTC_SPM_CTL_INITSECP: Initialization secure protection
      \arg        RTC_SPM_CTL_RTCSECP: RTC global secure protection 
    \param[out] none
    \retval     none
*/
void rtc_sec_pro_enable(uint32_t sub_area)
{
    RTC_SPM_CTL |= sub_area;
}

/*!
    \brief      disable RTC secure protection mode
    \param[in]  sub_area: specify which sub area of the RTC module to be removed from the protection of the secure mode
      \arg        RTC_SPM_CTL_ALRM0SECP: Alarm 0 protection
      \arg        RTC_SPM_CTL_ALRM1SECP:  Alarm 1 protection 
      \arg        RTC_SPM_CTL_WUTSECP:  Wakeup timer protection 
      \arg        RTC_SPM_CTL_TSSECP:  Timestamp protection 
      \arg        RTC_SPM_CTL_TAMPSECP:  Tamper protection (excluding backup registers)
      \arg        RTC_SPM_CTL_CALCSECP:  Shift register, daylight saving, calibration and reference clock protection 
      \arg        RTC_SPM_CTL_INITSECP:  Initialization protection
      \arg        RTC_SPM_CTL_RTCSECP:  RTC global protection 
    \param[out] none
    \retval     none
*/
void rtc_sec_pro_disable(uint32_t sub_area)
{ 
    RTC_SPM_CTL &= (uint32_t)~sub_area;
}

/*!
    \brief      set the RTC_BKP secure protection zonea tail value
    \param[in]  zonea_tail:RTC_BKP registers secure protection zonea
      \arg        RTC_BKP_PRO_ZONEA_TAIL_NONE: there is no RTC_BKP registers secure protection zonea
      \arg        RTC_BKP_PRO_ZONEA_TAIL_x(x = 0,1,2,...19):RTC_BKP registers secure protection zonea is from RTC_BKP0 to RTC_BKPx,\
                                                            which can be read and written only when the APB is in secure mode
    \param[out] none
    \retval     none
*/
void rtc_bkp_zonea_sec_pro_set(uint32_t zonea_tail)
{
    RTC_SPM_CTL &= (uint32_t)~ RTC_SPM_CTL_BKPRWSECP;
    RTC_SPM_CTL |= zonea_tail;
}

/*!
    \brief      set the RTC_BKP secure protection zoneb tail value
    \param[in]  zoneb_tail:RTC_BKP registers secure protection zoneb
      \arg        RTC_BKP_PRO_ZONEB_TAIL_NONE: there is no RTC_BKP registers secure protection zoneb
      \arg        RTC_BKP_PRO_ZONEB_TAIL_x(x = 0,1,2,...19):the last RTC_BKP register of secure protection zoneb is RTC_BKPx, 
                                                             if there is no RTC_BKP registers secure protection zoneb
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_bkp_zoneb_sec_pro_set(uint32_t zoneb_tail)
{
    ErrStatus error_status = ERROR;
    uint32_t zonea_tail = 0U;

    RTC_SPM_CTL &= (uint32_t)~ RTC_SPM_CTL_BKPWSECP;
    RTC_SPM_CTL |= zoneb_tail;
    
    zonea_tail = GET_SPM_CTL_BKPRWSECP(RTC_SPM_CTL);
    /* if zonea tail value is larger than or equal to the zoneb tail value, there is no zoneb.*/
    if(zonea_tail < zoneb_tail){
        error_status = SUCCESS;
    }

    return error_status;
}

/*!
    \brief      check the RTC_BKP secure protection zoneb is valid or not
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus rtc_bkp_zoneb_sec_pro_check(void)
{
    ErrStatus error_status = ERROR;
    uint32_t zonea_tail = 0U;
    uint32_t zoneb_tail = 0U;

    zonea_tail = GET_SPM_CTL_BKPRWSECP(RTC_SPM_CTL);
    zoneb_tail = GET_SPM_CTL_BKPWSECP(RTC_SPM_CTL);
    /* if zonea tail value is larger than or equal to the zoneb tail value, there is no zoneb.*/
    if(zonea_tail < zoneb_tail){
       error_status = SUCCESS;
    }
    return error_status;
}
